[
  {
    "id": 1,
    "title": "The Matrix",
    "language": "English",
    "year": 1999,
    "genre": [
      "Sci-Fi",
      "Action"
    ],
    "rating": 4.35,
    "director": "Wachowski Brothers",
    "runtime": 136,
    "synopsis": "Thomas Anderson, a computer hacker known as Neo, discovers that the world he lives in is a simulated reality called the Matrix, created by intelligent machines to subdue humans. Guided by the mysterious Morpheus and skilled fighter Trinity, Neo must confront his destiny as 'The One' to free humanity from its artificial bondage, facing intense combat, mind-bending challenges, and philosophical questions about reality and choice.",
    "cast": [
      "Keanu Reeves",
      "Laurence Fishburne"
    ],
    "reviewCount": 5,
    "averageReviewRating": 4.2,
    "posterUrl": "/The-Matrix.png"
  },
  {
    "id": 2,
    "title": "Inception",
    "language": "English",
    "year": 2010,
    "genre": [
      "Sci-Fi",
      "Thriller"
    ],
    "rating": 4.4,
    "director": "Christopher Nolan",
    "runtime": 148,
    "synopsis": "Dom Cobb is a skilled thief who steals secrets from deep within the subconscious during the dream state. Offered a chance to have his criminal record erased, Cobb must perform an 'inception'—implanting an idea into a target's mind. Alongside a team of specialists, he navigates layered dreams filled with suspense, shifting realities, and personal guilt, while trying to reunite with his children and confront his haunting past.",
    "cast": [
      "Leonardo DiCaprio",
      "Joseph Gordon-Levitt"
    ],
    "reviewCount": 6,
    "averageReviewRating": 4.5,
    "posterUrl": "/Inception.jpg"
  },
  {
    "id": 3,
    "title": "3 Idiots",
    "language": "Hindi",
    "year": 2009,
    "genre": [
      "Comedy",
      "Drama"
    ],
    "rating": 4.2,
    "director": "Rajkumar Hirani",
    "runtime": 170,
    "synopsis": "Farhan and Raju, two engineering students, embark on a journey to find their missing friend, Rancho. Through hilarious and emotional experiences, they challenge the rigid educational system, explore the pressures of parental expectations, and discover the true meaning of friendship, creativity, and following one's passion. The film intertwines comedy with poignant lessons on life and success.",
    "cast": [
      "Aamir Khan",
      "R. Madhavan",
      "Sharman Joshi",
      "Kareena Kapoor"
    ],
    "reviewCount": 8,
    "averageReviewRating": 4.5,
    "posterUrl": "/3-Idiots.jpg"
  },
  {
    "id": 4,
    "title": "Loot",
    "language": "Nepali",
    "year": 2012,
    "genre": [
      "Action",
      "Thriller"
    ],
    "rating": 3.95,
    "director": "Nischal Basnet",
    "runtime": 150,
    "synopsis": "Haku Kale, a cunning and charismatic thief, leads a gang planning a major bank heist in Kathmandu. The story follows the complex dynamics between gang members, their ambitions, and the unexpected twists that arise when personal motives clash with loyalty. Amidst high-stakes action and thrilling sequences, the film offers a gritty glimpse into crime, deception, and survival in the city.",
    "cast": [
      "Saugat Malla",
      "Dayahang Rai",
      "Rajesh Hamal"
    ],
    "reviewCount": 6,
    "averageReviewRating": 4.1,
    "posterUrl": "/Loot.jpg"
  },
  {
    "id": 5,
    "title": "Parasite",
    "language": "English",
    "year": 2019,
    "genre": [
      "Thriller",
      "Drama"
    ],
    "rating": 4.3,
    "director": "Bong Joon-ho",
    "runtime": 132,
    "synopsis": "The struggling Kim family cunningly infiltrates the wealthy Park household by posing as skilled professionals. As they embed themselves into the Parks' lives, hidden secrets, social tensions, and unexpected tragedies unfold. The film explores class disparity, greed, and the consequences of deception, culminating in a gripping climax that exposes the fragility of societal hierarchies and human ambition.",
    "cast": [
      "Kang-ho Song",
      "Sun-kyun Lee"
    ],
    "reviewCount": 7,
    "averageReviewRating": 4.4,
    "posterUrl": "/Parasite.jpg"
  },
  {
    "id": 6,
    "title": "Kabir Singh",
    "language": "Hindi",
    "year": 2019,
    "genre": [
      "Romance",
      "Drama"
    ],
    "rating": 3.55,
    "director": "Sandeep Reddy Vanga",
    "runtime": 170,
    "synopsis": "Kabir Singh, a brilliant but volatile surgeon, falls deeply in love with Preeti. When circumstances force them apart, Kabir spirals into self-destructive behavior, grappling with anger, alcoholism, and heartbreak. The film explores the intensity of obsessive love, emotional turmoil, and the consequences of unresolved grief and ego-driven choices, ultimately questioning redemption and self-realization.",
    "cast": [
      "Shahid Kapoor",
      "Kiara Advani"
    ],
    "reviewCount": 5,
    "averageReviewRating": 3.8,
    "posterUrl": "/Kabir-Singh.jpg"
  },
  {
    "id": 7,
    "title": "Avengers: Endgame",
    "language": "English",
    "year": 2019,
    "genre": [
      "Action",
      "Adventure"
    ],
    "rating": 4.2,
    "director": "Anthony Russo, Joe Russo",
    "runtime": 181,
    "synopsis": "Following the devastating events of Infinity War, the remaining Avengers band together to undo Thanos’ catastrophic actions. Traveling through time and space, they face formidable challenges, confront personal failures, and make ultimate sacrifices. The epic culmination of over a decade of storytelling showcases heroism, camaraderie, and the enduring fight for justice, delivering high-stakes action and emotional resonance.",
    "cast": [
      "Robert Downey Jr.",
      "Chris Evans"
    ],
    "reviewCount": 10,
    "averageReviewRating": 4.7,
    "posterUrl": "/Avengers-Endgame.jpg"
  },
  {
    "id": 8,
    "title": "Dangal",
    "language": "Hindi",
    "year": 2016,
    "genre": [
      "Sports",
      "Drama"
    ],
    "rating": 4.2,
    "director": "Nitesh Tiwari",
    "runtime": 161,
    "synopsis": "Former wrestler Mahavir Singh Phogat trains his daughters, Geeta and Babita, to become elite wrestlers in a male-dominated society. Facing societal resistance and personal challenges, the girls excel in national and international wrestling competitions. The film highlights perseverance, gender equality, and familial bonds, blending intense sports action with emotional storytelling.",
    "cast": [
      "Aamir Khan",
      "Sanya Malhotra"
    ],
    "reviewCount": 9,
    "averageReviewRating": 4.6,
    "posterUrl": "/Dangal.jpg"
  },
  {
    "id": 9,
    "title": "Chhakka Panja",
    "language": "Nepali",
    "year": 2016,
    "genre": [
      "Comedy",
      "Drama"
    ],
    "rating": 3.6,
    "director": "Deepa Shree Niraula",
    "runtime": 150,
    "synopsis": "A lighthearted comedy depicting the everyday struggles of middle-class families in Kathmandu. Through humorous situations, misunderstandings, and eccentric characters, the film explores love, friendship, and social issues. Despite its comedic tone, it subtly addresses aspirations, relationships, and the challenges of urban life in Nepal.",
    "cast": [
      "Magne Buda",
      "Jeetu Nepal"
    ],
    "reviewCount": 4,
    "averageReviewRating": 3.9,
    "posterUrl": "/Chakka-Panja.jpg"
  },
  {
    "id": 10,
    "title": "The Dark Knight",
    "language": "English",
    "year": 2008,
    "genre": [
      "Action",
      "Crime"
    ],
    "rating": 4.5,
    "director": "Christopher Nolan",
    "runtime": 152,
    "synopsis": "Batman faces his greatest nemesis, the Joker, who unleashes chaos on Gotham City. As crime escalates and moral dilemmas intensify, Batman must balance justice, ethics, and personal sacrifice. With masterful storytelling, intense action, and complex character arcs, the film examines the fine line between heroism and vigilantism, leaving an indelible impact on audiences.",
    "cast": [
      "Christian Bale",
      "Heath Ledger"
    ],
    "reviewCount": 12,
    "averageReviewRating": 4.9,
    "posterUrl": "/The-Dark-Knight.jpg"
  },
  {
    "id": 11,
    "title": "Swades",
    "language": "Hindi",
    "year": 2004,
    "genre": [
      "Drama"
    ],
    "rating": 4.1,
    "director": "Ashutosh Gowariker",
    "runtime": 189,
    "synopsis": "Mohan Bhargava, an NRI working at NASA, returns to India to find his childhood nanny. Witnessing the struggles of rural life, he is inspired to bring electricity and development to his village. Swades explores themes of social responsibility, patriotism, and the transformative power of education and community, blending heartfelt storytelling with social commentary.",
    "cast": [
      "Shah Rukh Khan",
      "Gayatri Joshi"
    ],
    "reviewCount": 6,
    "averageReviewRating": 4.3,
    "posterUrl": "/Swades.jpg"
  },
  {
    "id": 12,
    "title": "Kabaddi",
    "language": "Nepali",
    "year": 2013,
    "genre": [
      "Romance",
      "Comedy"
    ],
    "rating": 3.75,
    "director": "Shiva Regmi",
    "runtime": 145,
    "synopsis": "Set in rural Nepal, Kabaddi follows the humorous and sometimes heartwarming story of Kazi, a man in love with a local girl. Through misadventures, community interactions, and traditional games, he navigates the challenges of unrequited love, societal expectations, and cultural norms, delivering a mix of comedy, romance, and small-town charm.",
    "cast": [
      "Saugat Malla",
      "Rishma Gurung"
    ],
    "reviewCount": 5,
    "averageReviewRating": 4,
    "posterUrl": "/Kabaddi.jpg"
  },
  {
    "id": 13,
    "title": "Interstellar",
    "language": "English",
    "year": 2014,
    "genre": [
      "Sci-Fi",
      "Adventure"
    ],
    "rating": 4.3,
    "director": "Christopher Nolan",
    "runtime": 169,
    "synopsis": "Earth is facing ecological collapse, and former NASA pilot Cooper is recruited to lead a team of explorers through a wormhole in search of a new habitable planet. Battling time dilation, cosmic anomalies, and emotional separation from his family, Cooper faces existential questions about humanity's survival and his personal legacy. The film merges scientific theory with human drama in an epic space adventure.",
    "cast": [
      "Matthew McConaughey",
      "Anne Hathaway"
    ],
    "reviewCount": 7,
    "averageReviewRating": 4.5,
    "posterUrl": "/Interstellar.jpg"
  },
  {
    "id": 14,
    "title": "Barfi!",
    "language": "Hindi",
    "year": 2012,
    "genre": [
      "Romance",
      "Comedy",
      "Drama"
    ],
    "rating": 4.05,
    "director": "Anurag Basu",
    "runtime": 151,
    "synopsis": "Set in Darjeeling, Barfi! tells the story of Murphy 'Barfi' Johnson, a charming and deaf-mute young man, who falls in love with Shruti and later befriends Jhilmil, an autistic girl from a wealthy family. Through heartwarming events, comedic moments, and emotional twists, the film explores love, innocence, sacrifice, and the beauty of human connection beyond societal norms and physical abilities.",
    "cast": [
      "Ranbir Kapoor",
      "Priyanka Chopra"
    ],
    "reviewCount": 6,
    "averageReviewRating": 4.2,
    "posterUrl": "/Barfi.jpg"
  },
  {
    "id": 15,
    "title": "Pashupati Prasad",
    "language": "Nepali",
    "year": 2016,
    "genre": [
      "Drama",
      "Comedy"
    ],
    "rating": 4,
    "director": "Dipendra K Khanal",
    "runtime": 135,
    "synopsis": "After the death of his father, Pashupati Prasad arrives in Kathmandu to repay his family’s debts. Facing exploitation, corruption, and societal hardships, he navigates the complexities of city life with wit, courage, and resilience. The film combines social critique with humor, showcasing human struggle, morality, and the relentless pursuit of dignity amidst adversity.",
    "cast": [
      "Paul Shah",
      "Bipin Karki"
    ],
    "reviewCount": 6,
    "averageReviewRating": 4.3,
    "posterUrl": "/Pashupati-Prasad.jpg"
  },
  {
    "id": 16,
    "title": "Titanic",
    "language": "English",
    "year": 1997,
    "genre": [
      "Romance",
      "Drama"
    ],
    "rating": 3.9,
    "director": "James Cameron",
    "runtime": 195,
    "synopsis": "Jack, a poor artist, and Rose, a wealthy socialite, fall in love aboard the RMS Titanic during its maiden voyage. Their romance blossoms amid class barriers and societal expectations. When the ship hits an iceberg, their love is tested against the backdrop of disaster, heroism, and tragedy. Titanic is an epic tale of romance, survival, and the fleeting nature of life, blending historical events with emotional storytelling.",
    "cast": [
      "Leonardo DiCaprio",
      "Kate Winslet"
    ],
    "reviewCount": 9,
    "averageReviewRating": 4.4,
    "posterUrl": "/Titanic.jpg"
  },
  {
    "id": 17,
    "title": "Queen",
    "language": "Hindi",
    "year": 2014,
    "genre": [
      "Comedy",
      "Drama"
    ],
    "rating": 4.1,
    "director": "Vikas Bahl",
    "runtime": 146,
    "synopsis": "After her fiancé calls off their wedding, Rani embarks on a solo honeymoon to Europe. Through unexpected friendships, cultural experiences, and personal challenges, she discovers independence, self-respect, and inner strength. The film celebrates personal growth, resilience, and empowerment, blending humor, adventure, and heartfelt moments in a journey of self-discovery.",
    "cast": [
      "Kangana Ranaut"
    ],
    "reviewCount": 7,
    "averageReviewRating": 4.5,
    "posterUrl": "/Queen.jpg"
  },
  {
    "id": 18,
    "title": "Kagbeni",
    "language": "Nepali",
    "year": 2008,
    "genre": [
      "Horror",
      "Thriller"
    ],
    "rating": 3.8,
    "director": "Bhusan Dahal",
    "runtime": 120,
    "synopsis": "Set in a remote Himalayan village, Kagbeni tells the story of two friends whose lives are disrupted by mysterious events and local superstitions. As the line between reality and myth blurs, the villagers confront fear, suspicion, and morality. The film combines suspense, horror, and psychological tension with breathtaking landscapes, creating a haunting tale of mystery and human vulnerability.",
    "cast": [
      "Saugat Malla",
      "Deeya Maskey"
    ],
    "reviewCount": 4,
    "averageReviewRating": 4,
    "posterUrl": "/Kagbeni.jpg"
  },
  {
    "id": 19,
    "title": "The Shawshank Redemption",
    "language": "English",
    "year": 1994,
    "genre": [
      "Drama"
    ],
    "rating": 4.65,
    "director": "Frank Darabont",
    "runtime": 142,
    "synopsis": "Andy Dufresne, falsely convicted of murder, is sent to Shawshank State Penitentiary. Over decades, he forms a friendship with Red, navigates prison life, and executes a meticulously planned escape. The story explores hope, resilience, justice, and the power of human spirit amidst adversity. Shawshank Redemption is a profound and inspiring tale of endurance, freedom, and redemption.",
    "cast": [
      "Tim Robbins",
      "Morgan Freeman"
    ],
    "reviewCount": 12,
    "averageReviewRating": 5,
    "posterUrl": "/Shawshank-Redemption.jpg"
  },
  {
    "id": 20,
    "title": "Lagaan",
    "language": "Hindi",
    "year": 2001,
    "genre": [
      "Sports",
      "Drama"
    ],
    "rating": 4.05,
    "director": "Ashutosh Gowariker",
    "runtime": 224,
    "synopsis": "During the British Raj, villagers of Champaner face impossible taxes (lagaan). Led by Bhuvan, they challenge the British officers to a cricket match, wagering their future. Despite lack of experience, the villagers learn teamwork, strategy, and resilience. Lagaan is a cinematic blend of sports, drama, patriotism, and cultural pride, celebrating courage, unity, and the triumph of the underdog against oppressive forces.",
    "cast": [
      "Aamir Khan",
      "Gracy Singh"
    ],
    "reviewCount": 6,
    "averageReviewRating": 4.3,
    "posterUrl": "/Lagaan.jpg"
  }
]